# RemoveParameter Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyManager..::..RemoveParameter Method
FamilyManager Class See Also
---
Remove an existing family parameter from the family.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void RemoveParameter(
	FamilyParameter familyParameter
)
```

Visual Basic
---
```text
Public Sub RemoveParameter ( _
	familyParameter As FamilyParameter _
)
```

Visual C++
---
```text
public:
void RemoveParameter(
	FamilyParameter^ familyParameter
)
```

# ### Parameters
familyParameter
    Type: Autodesk.Revit.DB..::..FamilyParameterThe family parameter.
# Remarks
Only family and shared parameters may be removed, built-in parameters may not be removed. If the parameter is used in any formulas, those formulas will be automatically removed along with the parameter.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the input argument-"familyParameter"-is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when the input argument-"familyParameter"-is an invalid parameter or a builtIn parameter. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the family parameter deletion failed. |

# See Also
FamilyManager Class
Autodesk.Revit.DB Namespace